{"pages":[],"posts":[{"title":"2019年春季学期工作规划","text":"部门培训 培训项目 主要内容 负责人 时间 网络基础知识 计算机网络模型分析 鲍锐 第三周 物理层基础 组网硬件和物理层协议 鲍锐 第四周 链路层基础 数据链路和分组交换 杨澳 第五周 网络层基础 IP协议和路由技术 汪鹤然 第六周、第七周 传输层基础 TCP连接到建立和断开 鲍锐 第八周 应用层概述 DHCP、TFTP、DNS和HTTPS 祁鹤翔 第九周、第十周 对外培训 对象 培训项目 负责人 时间 SNC Windows 10的使用和维护 王昊 未定 开发组 网络基础知识 汪鹤然 未定 开发组 HTTPS协议 祁鹤翔 未定 部门内务活动规划团建计划","link":"/2021/05/11/2019%E5%B9%B4%E6%98%A5%E5%AD%A3%E5%B7%A5%E4%BD%9C%E8%A7%84%E5%88%92/"},{"title":"X-ware管理条例","text":"序言：X-ware的存在和价值X-ware是SNC传统的活动之一，是为全校师生提供计算机技术支持的平台。它服务的内容，涵盖了计算机的硬件（Hardware）和软件（Software）两个方面，这也是其名称“X-ware”的由来。X-ware服务的价值，不仅仅在于使广大师生获得便利，更重要的是锻炼系统维护组成员的实践动手能力。通过这样一项服务，我们的成员确实得到了更多的实践机会，也在实践过程中的对系统维护中一些知识和思想有了更加深刻的理解。总而言之，无论对内还是对外，X-ware服务都是一项有价值、有意义的活动。 X-ware管理条例：内部工作条例预约管理制度 （待定）只接受提交了预约的求助； （待定）预约表的内容应包括：姓名、学院、预计前来时间、问题描述、联系方式（QQ/微信）； 每次X-ware服务的预约时间为上周四17:00:00-本周四16:59:59，这一情况应在预约页面上说明； 系统维护组与媒体运营部的管理团队负责预约表的处理； （待定）每周四下午19:00前，媒体运营部将预约表发送给系统维护组； （待定）系统维护组应与预约人取得联系，确认是否前来。服务引导 每周安排一名同学负责引导和签到； 在X-ware正式开始前，准备好签到表，预先写好预约人的信息，到达后预约人只需确认签名即可； 原则上，负责签到的同学不应该参与到服务中。服务秩序 工作位置间隔出来的位置提供给前来的同学； 在工作过程中，尽可能不要将工作转交给其他同学（技术问题不在此列），不要冷落同学； 在操作过程中，尽可能做出必要的解释； 每个成员可以同时负责不超过两台的设备。注意事项 尊重他人隐私，在操作过程中不进入无关的个人文件夹、文件备份前必须征得同意，操作根据附录中备份条例进行； 谨慎操作，不得使用“移动”功能，使用“复制”+“删除”，在进行删除文件、格式化磁盘、删除分区等操作前至少向所有者确认三次； 拆机前向所有者确认至少三次，说明可能带来的后果； 不强行解决已知超过能力范围的问题； 禁止向同学提供（线上和线下，尤其是线上）各类不符合版权规定的软件安装包/源代码； 在对外宣传时禁止宣称提供不符合版权规定的软件安装服务。X-ware管理条例：对外服务流程 预约：前来求助的同学，应该首先通过微信公众号X-ware预约平台进行预约； 确认：在服务开始前，会有系统维护组成员向预约的同学确认是否前来； 签到：在X-ware登记表上确认信息无误后，签字进行确认； 负责引导的同学将前来的同学引导到对应的SNC成员处； SNC成员提供服务，如果求助同学需要提前离开，提供服务的同学应确认该同学的个人信息和联系方式，以保证可以取得联系。附录关于数字校园激活客户端的使用数字校园的激活客户端需要使用 .Net框架，在Windows 10上，这不是一个默认安装的组件，导致在使用客户端时必须要联网安装该框架。实际上，该框架的联网安装在校园网环境内较为困难，因此提出了下面的解决方法： 需要用到的程序：Windows 10、DISM++、对应版本的Windows 10安装镜像 首先，挂载Windows 10的安装镜像； 启动DISM++，在程序和功能中找到Windows功能； 勾选 .Net Framework 3.5，并在本地源中选择镜像目录下的/sources/sxs目录，点击应用； 安装进度条显示在左上，完成后退出。 完成了上述处理之后，就可以使用激活客户端了。 关于备份的有关规定X-ware服务过程中产生的零时备份文件，应该存储于SNC所有的存储介质中，在恢复完成之后当面删除备份文件；该介质严禁外借。","link":"/2021/05/11/X-ware%E7%AE%A1%E7%90%86%E6%9D%A1%E4%BE%8B/"},{"title":"esp8266-12F(默认MQTT固件)学习笔记（一）","text":"使用芯片安信可esp8266系列的12F 接线图安信可esp-12F的芯片有多种固件，淘宝上购买选择了MQTT固件的TTL引脚并不是MCU上默认标注的TXD0/RXD0，而是GPIO15和GPIO13。上图是安信可官方入门教程中的默认接线图，但并不适用默认MQTT固件的esp-12F。默认MQTT固件的接口是：GPIO13为ESP_RXD，GPIO15为ESP_TXD，串口1作为log串口，默认波特率为115200。 AT指令按照安信可官方给出的AT指令集进行测试，测试了esp-12F与上位机进行TCP，UDP通讯。 TCP透传实验 1234567891011121314151617181920212223242526272829303132333435AT+CWMODE=3 //选择wifi模式OKAT+CWJAP=&quot;wjd&quot;,&quot;123456789&quot; //连接至wifi，这是我的手机热点WIFI DISCONNECTWIFI CONNECTEDWIFI GOT IPOKAT+CIFSR //查看IP地址和MAC地址+CIFSR:APIP,&quot;192.168.4.1&quot;+CIFSR:APMAC,&quot;86:cc:a8:9a:41:d3&quot;+CIFSR:STAIP,&quot;192.168.43.166&quot;+CIFSR:STAMAC,&quot;84:cc:a8:9a:41:d3&quot;OKAT+CIPSTART=&quot;TCP&quot;,&quot;192.168.43.145&quot;,8080 //建立TCP链接，第二个和第三个参数分别为上位机的IP地址和端口，需要使用TCP/UDP调试工具建立服务器CONNECTOKAT+CIPMODE=1 //设置透传模式OKAT+CIPSEND //发送数据OK&gt;OKAT+CIPCLOSE //关闭连接CLOSEDOK 注意： 上位机与esp-12F需连接至同一局域网下，同时连接至一个wifi信号或者用计算机连接esp-12F的wifi信号。 AT+CIPSEND后是发送数据，发送不带新行的+++数据结束发送。 参考教程为安可信官方给出的AT指令集说明。文档连接：https://docs.ai-thinker.com/esp8266/docs（ps: 安可信官网的文档非常难找）","link":"/2020/12/05/esp8266-12F(1)/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/11/30/hello-world/"},{"title":"你的反馈","text":"你的反馈","link":"/2021/05/11/other_zh/"},{"title":"学生网络中心出行专题2021-5-10","text":"12345678昌36从昌平北站出发时间8:00、10:00、12:00、15:00、18:00；从虎峪出发时间为7:00、9:00、11:00、14:00、16:30昌68从朝凤庵村发车时间5：30-18：30；从虎峪路发车时间6：30-19：30；发车间隔为15到30分钟。![](RackMultipart20210511-4-19ftedd_html_252970fff71d2bb8.jpg)从昌平西山口发车的昌平线时间5：45-22：50；发车间隔为3到10分钟","link":"/2021/05/12/%E5%87%BA%E8%A1%8C/"},{"title":"功能建议概述","text":"确保你在提交功能建议之前仔细阅读了Hexo文档，Icarus用户指南，和GitHub issues来了解你的建议是否已经被他人提出过。 你的功能建议与某个使用问题相关么？请详述。 简洁清晰地描述你遇到的问题是什么（如：我在使用…的时候遇到了…）。 描述你想要的解决方案 简洁清晰地描述你想要的解决方案可以达到的效果。 描述你考虑过的替代办法 简洁清晰地描述你考虑过的替代解决方案或是新功能。 额外上下文 附上与功能请求有关的其他上下文信息或者截图。","link":"/2021/05/11/%E5%8A%9F%E8%83%BD%E5%BB%BA%E8%AE%AE/"},{"title":"北京化工大学学生网络中心","text":"北京化工大学学生网络中心(BUCT Student Network Center)成立于2001年4月，作为我校第二课堂人才培养基地、大学生创新基地，承担了校园网络社区的建设、管理和维护工作，并肩负了向全校师生普及电脑和网络知识、营造良好校园网络文化氛围的职责。秉承“技术、激情、协作、创新”的精神实质，SNC自成立以来一直参与学校创新人才培养工作，为同学们的学习生活、成长成才服务，并为每位怀有激情和创新精神的成员提供发挥自我、超越自我的舞台。 SNC下设办公室、开发部、UI设计部、系统维护部、媒体运营部、市场部、宣传部七个职能部门，涵盖软件开发、系统架构与维护、网络设计、网络媒体运营、用户体验设计及IT组织管理六个方面。 在全体成员的共同参与下，SNC努力发挥人才培养、实践创新、工作职能三位一体的作用，积极参与学校创新人才培养、学生工作信息化建设、网络思想政治教育等工作；为全校师生无偿提供笔记本软件和硬件维修服务（X-ware服务），承担着校园网络社区的建设、管理和维护工作，肩负向全校师生普及电脑和网络知识、营造良好校园网络文化氛围的职责。SNC各项活动有知识、有水平、有意义，其中“笔记本知识讲座”、“班级主页及logo设计大赛”、“烟花三月”、“网络文明周”、“毕业文化衫图样征集”等品牌活动均成功举办十届以上。 宗旨为同学们的学习生活、成长成才服务。 精神实质技术、激情、协作、创新。 指导原则在发展过程中，学生网络中心逐渐树立起自己独特的风格，指导原则为“以服务为宗旨、以内容为核心、以技术为基础、以管理作保障”。技术与管理结合，是学生网络中心所倡导的发展方向。对于每一个进入学生网络中心的同学，都要求以主人翁的姿态在日常培训和实际项目工作中充分学习技术知识、管理知识和相应业务知识，各方面、全方位的发展，为以后的就业、继续学习深造奠定一定的基础。 负责工作北京化工大学胜古朝阳——爱北化校园网络社区、花样年华学生网站、学生工作数字化解决方案以及校内其它校内学生工作网络的建设、管理和维护工作，并肩负了向全校师生普及电脑和网络知识、营造良好网络文化氛围，参与学生论坛管理的职责。 发展历史2001年4月，北京化工大学学生网络中心正式成立，一群饱含激情、才华出众、技术娴熟的大学生们组成了中心引以为自豪的自主开发团队，负责学生网站的建设，而且积极参与学生网络的管理。 2001年9月10日，学生网络中心正式推出了化大的学生门户网站，该网站经过一年的运转在第二年4月又进行了第二版的更新。 2002年4月，学生网络中心北区分中心成立。 2002年10月，中心邀请微软中国有限公司总裁唐骏博士来我校演讲，为同学们提供了一个与IT界知名人士零距离交流的机会。同年11月，学生讨论区的启动又在化 大掀起了一股网上讨论的热浪。两年里，中心本着精益求精的宗旨，对网站进行了一次次的修改与完善。而且中心在“挑战者”杯网络知识竞赛等首都高校活动中发 挥了重要的作用。 2003年5月，为配合我校防治非典工作的顺利开展，中心站在了化大师生同心协力抵抗病魔的战斗一线，组织技术骨干制作了防SARS专题栏目。 2003年9月中旬起,为了给化大师生提供更广阔的网上交流园地，中心对“花样年华”学生社区的建设进行了紧锣密鼓的规划，技术骨干们加班加点、连续奋战近80天，最终顺利完成了该社区的开发和内部测试工作，于2003年12月正式发布“花样年华”学生社区。 2003年6月至7月期间，为保证向广大师生提供一流的服务，学校为中心提供了优越的物质条件，对学生网络中心机房进行了全面的装修：不仅为中心配备了宽敞舒适的 办公室，还投入了大量资金购买配套设备以完善中心的硬件设施。中心现有WEB、FTP、VOD、DNS服务器多台以及性能优良的工作站和齐全的办公设备。 2004年3月，首届“烟花三月”校园原创网络文学大赛启动，大赛由我校学生网络中心及《萌芽》杂志社共同主办，并由搜狐校园频道作为独家门户网络支持，本着“打造校园文学新阵地”宗旨，旨在推动校园文学发展，鼓励原创。 同年11月，举办了此次比赛的颁奖晚会。 2004年4月，中心在重视硬件设施建设的同时，也在努力促使“软件”方面的加强，各级学生网络管理队伍在学生网络中心的大力支持下初步成立。成立后，管理层严格 要求技术骨干不断学习、创新，并且定期组织人员培训以提高服务的技术水平，使得中心成员成功具备服务意识、责任意识、高标准要求、团结协作、服务大局等素 质。与此同时，管理层也一直坚持在广大同学中发掘人才,为团队补充新鲜的血液，完善自身队伍。另外，中心还致力于管理模式的改革，在内部机构中实行学生干 部责任制与项目管理制相结合的管理模式。可以说，在不断地摸索与探索中，中心在逐步走向成熟，走向完善。 2005年3月，第二届“烟花三月”校园原创网络文学大赛启动，同年10月举办了本次活动的颁奖晚会。 2006年6月，中心以网络为依托，推出《探寻》系列电子杂志，并于11月出版《探寻·秋韵》。这个尝试引入了一个新的校园媒体传播方式。 2006年7月，为了丰富同学们的课余生活，增强班级凝聚力，引导大家更好地运用计算机和网络工具，中心举办了第一届班级主页及LOGO设计大赛。本次活动搭建了一个展现班级风采及当代大学生自主创新能力的平台，活动中同学们踊跃投稿，反响强烈。 2006年10月，第三届“烟花三月”网络文学大赛颁奖晚会在北功厅成功举办。一年一度的大赛不仅拉近了同学们与文学的距离，更加深了各大高校间的友好关系。 2006年10月29日，学生网络中心随我校北区740名大学生志愿者参加奥运志愿“微笑圈”测试版发布仪式暨“我们在长城传递微笑”大型主题宣传活动。 2007年6月，成功举办第一届毕业文化衫图样征集活动，通过网络征集、投票，毕业班学生代表投票，专家老师评选，最终确定了中标作品，本次活动的开展为毕业教育环节增加了人文气息，收到了我校师生的广泛好评。 2008年4月，为了向同学们大力宣传网络文明的知识，提倡文明上网，中心举办网络文明周活动正式开始。 2008 年5月5日，第一届“北区印象”活动正式拉开帷幕。活动以北区为载体，面向全校学生，作品征集范围广泛，包括DV、音乐、文字、图片等众多类型的作品。开 创了化工大学学生多媒体文化的先河。类型广泛的作品征集给校园中创意无限的同学们提供了更广阔的发挥空间，同时给同学们的大学生活留下了一份珍贵的回忆。 2008年10月，第三届班级主页及LOGO设计大赛如期举行。 2008年11月，制作“回首网事”——中国、北化网络发展30年专题网站。 2009年3月，“烟花三月”活动在东北两区同时开展，东区举办了大学生春景摄影大赛活动，北区举办了大学生风采展示活动，收集到文学、视频、图片等作品。 2009 年5月，第二届“北区印象”活动启动，本次活动旨在为2007级学生的北区生活留下珍贵记忆。该活动自开展之日起受到了学校各级领导的关心和指导，各级学 生组织以及全体2007级学生也给予了大力支持。《北区印象》纪念光盘包括领导寄语、辅导员风采展示、班级合影相册、军训实录、学生组织回忆录、个人作品 等内容，这张光盘中凝聚了领导、老师、学生们共同努力的汗水。光盘于11月在中心会议室成功发布。 2009年10月，以国庆60周年为契机，制作国庆60周年主题网站，网站体现了两部分内容：中国六十年发展的大事记、北化参与群众游行同学们的日常训练。 2009年11月，第六届中国联通杯“烟花三月”大学生风采展示活动颁奖晚会在北京化工大学北区北功厅胜利闭幕。同期，第四届班级主页及LOGO设计大赛拉开序幕。 2010年3月，第七届中国联通杯“烟花三月”大学生风采展示活动成功举办，本届活动同包括清华大学在内的二十一所北京重点高校合作，并取得了中国联通公司、《校园时代》、《大学生杂志社》等多家单位的大力支持。 2010年4月，中心承担了为2006级本科生制作毕业光盘——《北化印象》的任务，毕业光盘是学校第一次为毕业生们送上的一份珍贵礼物。光盘在毕业晚会上由学工办主任罗伟老师揭幕，并于现场首映。 2010年6月，第三届“北区印象”发布会在北区多功能厅召开，视频剪辑首次亮相。 2010年9月，花样年华学生网站公测。 2010年11月，第五届班级主页及LOGO设计大赛举行。 2011年3月，第八届“烟花三月”大学生风采展示活动开幕，同年7月，第八届“烟花三月”大学生风采展示活动颁奖晚会顺利闭幕。 2011年4月，学生网络中心大学生创新基地建立。 2011年5月，学生网络中心第二课堂人才培养基地成立。 2011年6月，学生网络中心成立十周年座谈会成功举办，1999级至2006级已毕业成员代表及部分2011届毕业成员参加了座谈会。 2013年5月，“胜古朝阳——爱北化校园网络社区”启动。 2014年3月，“胜古朝阳——爱北化校园网络社区”获评全国高校百佳网站。 2015年4月，“胜古朝阳——爱北化校园网络社区”连续获评全国高校百佳网站。 2015年5月，“北有佳人，化说秦时”——秦时明月粉丝见面会成功举办，到场嘉宾有：媒介部经理，著名coser小小白；特效制作总监，应炜；文学编剧，赵亮。 2016年5月，承办锐普PPT·2016年全国高校公益巡讲活动。 2016年6月，举办学生网络中心成立十五周年纪念活动，邀请1999至2011级已毕业成员返校参加活动。 2019年10月，技术部拆分为开发部、UI设计部、系统维护部。","link":"/2021/05/12/%E5%AD%A6%E7%94%9F%E7%BD%91%E7%BB%9C%E4%B8%AD%E5%BF%83/"},{"title":"学生网络中心班车攻略2021-05-08","text":"1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192939495**班车攻略**特别说明预约乘坐校班车请使用微信号（绿色）进行预约，使用企业微信可能会预约后无法付款给您的出行造成延误。请尽量在前一天16:00前进行预约班车（乘车当天进行预约可能会出现已经预约满而无法预约成功的情况）。一、班车预约方式1. 打开微信或者企业微信2. 搜索框内输入&quot;班车预约&quot;3. 打开&quot;班车预约&quot;公众号4. 在下方菜单中选择&quot;学生预约&quot;或&quot;教师预约&quot;5. 在出现的子菜单中选择&quot;预约&quot;6. 在新页面中填入个人信息、预约时间以及乘车区间之后点击&quot;查询&quot;7. 选择自己乘坐的班车车次点击&quot;预约&quot;8. 选择支付方式，然后按照自己的支付方式支付成功即可班车预约须知1. 班车预约时间：学生(1)当天可预约第二日班车和未来整个学期内班车，班车发车时间前一天16:00之后停止预约该趟班车(2)周六日班车必须在周五16:00之前预约老师(1)当日班车及未来14天内班车，发车前一小时停止预约(2)每天16:00-17:00暂停预约(3)16:00之前预约班车无人数限制，17:00之后系统管理员会按照剩余座位数来限制预约人数(4)周六日的班车必须在周五16:00之前预约，16:00之后将不会再开放1. 班车收费标准：12元/单程/人（东区和马甸乘车至新校区）10元/单程/人（西三旗乘车至新校区）12元/单程/人（新校区乘车至东区和马甸）10元/单程/人（新校区乘车至西三旗）1. 班车预约规则：用户预约查询时只会查询出可预约的班车信息，选择班车后须在5分钟之内完成支付。（微信端预约，点击预约按钮自动跳转支付界面；电脑端预约会弹出二维码，使用微信扫描支付）注：支付成功后，系统会通过微信企业号及邮箱发送预约成功的信息。并在发车前一天16：00之后系统会根据预约详情确定用户的详细座位信息（如01车8排C座），通过微信企业号和邮箱发送到用户的手机上。系统在用户第一次使用时会提示用户输入邮箱。用户乘车时通过刷校园卡进行乘车验证。1. 班车解约规则：学生(1)发车前三个小时以上用户解约全额退款。(2)发车前三个小时内解约扣除票款2元。(3)发车前没有解约且没有乘坐该趟班车扣除票款4元，车队在五天之内核实信息并将剩余票款原路退还。(4)每天16:00到16:30为系统调整时间，暂停解约操作。注：解约成功后，系统会通过微信以及短信发送消息。老师(1)发车前三个小时以上用户解约全额退款。(2)发车前三个小时内解约扣除票款2元。(3)发车前没有解约且没有乘坐该趟班车扣除票款4元，车队在五天之内核实信息并将剩余票款原路退还。(4)每天16:00到16:30为系统调整时间，暂停解约操作。注：解约成功后，系统会通过微信以及短信发送消息。班车预约技巧1. 确定好日期后，尽早预约班车，周五、周六、周日最好提前十四天购买2. 在没票的情况下，继续关注车票情况，可以买到别人退掉的票若用户预约成功后收不到车票请进行如下操作：·如图一所示，进入北京化工大学企业号后，点击设置按钮进入设置界面，将接收应用消息选项打开如图二所示。·如图三所示，进入班车预约界面，点击右上角的按钮进入设置界面，将息免打扰选项关闭如图四所示。![](RackMultipart20210511-4-b1593g_html_83e9c8d9bf439b09.jpg) ![](RackMultipart20210511-4-b1593g_html_998ef157f10b1705.jpg)![](RackMultipart20210511-4-b1593g_html_fd8165d7899fd55.jpg) ![](RackMultipart20210511-4-b1593g_html_226baef28b468295.jpg)3 ​","link":"/2021/05/11/%E5%AD%A6%E7%94%9F%E7%BD%91%E7%BB%9C%E4%B8%AD%E5%BF%83%E7%8F%AD%E8%BD%A6%E6%94%BB%E7%95%A52021-05-08/"}],"tags":[{"name":"SNC","slug":"SNC","link":"/tags/SNC/"},{"name":"ESP8266","slug":"ESP8266","link":"/tags/ESP8266/"},{"name":"学习","slug":"学习","link":"/tags/%E5%AD%A6%E4%B9%A0/"},{"name":"HEXO","slug":"HEXO","link":"/tags/HEXO/"},{"name":"生活","slug":"生活","link":"/tags/%E7%94%9F%E6%B4%BB/"}],"categories":[{"name":"SNC","slug":"SNC","link":"/categories/SNC/"},{"name":"学习","slug":"学习","link":"/categories/%E5%AD%A6%E4%B9%A0/"},{"name":"HEXO","slug":"HEXO","link":"/categories/HEXO/"},{"name":"生活","slug":"生活","link":"/categories/%E7%94%9F%E6%B4%BB/"},{"name":"about","slug":"about","link":"/categories/about/"}]}